# isRational Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbSpline..::..isRational Property
NurbSpline Class See Also
---
Returns whether the nurb spline is rational or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool isRational { get; }
```

Visual Basic
---
```text
Public ReadOnly Property isRational As Boolean
	Get
```

Visual C++
---
```text
public:
property bool isRational {
	bool get ();
}
```

# See Also
NurbSpline Class
Autodesk.Revit.DB Namespace